Revit 2026 API

# ExtElemChangeBeamSectionRegistryUnregister Method

---

Unregisters IExtElemChangeBeamSection.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static void Unregister()
```
```vb
Public Shared Sub Unregister
```
```cpp
public:
static void Unregister()
```
```fsharp
static member Unregister : unit -> unit
```

| Exception | Condition |
| --- | --- |
| InvalidOperationException | There is no valid Connections Provider registered. |

#### Reference

ExtElemChangeBeamSectionRegistry Class

Autodesk.Revit.DB.Structure Namespace